[A_ArcaneEmpowerment_Buff H7BaseBuff]
mName="奥术激荡"
mTooltip="对第一个近战攻击或反击的敌方生物造成 %d1.min %ICON_PRIME 源力伤害。"

[A_ArcaneBrilliance_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术开化"
mTooltip="元变魔法对英雄魔力的加成翻倍。"

[A_ArcaneShield_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术护盾"
mTooltip="每个战斗回合开始时，所有友方生物获得奥术护盾，吸收相当于元变魔法值 %buff1.buff.special.val1 倍的伤害。"

[A_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术催化"
mTooltip="英雄施放的每个法术增加 %stat.norm 点元变魔法。"

[A_ArcaneShield_Buff H7BaseBuff]
mName="奥术护盾"
mTooltip="吸收最多 %special.val3 伤害。\n持续到战斗回合结束或所有伤害被吸收。"

[A_Metamagic_Buff_MagicIncrease H7BaseBuff]
mName="元变魔法"
mTooltip="%stat1.norm 元变魔法"

[A_ArcaneShield_Buff_Marker H7BaseBuff]
mName=""
mTooltip=""

[A_ArcaneChanneling_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术通引"
mTooltip="小型方尖碑每战斗回合的第一次攻击增加 %buff.buff.buff.buff.stat.norm 点元变魔法。"

[A_ArcaneChanneling_Buff_WarfareUnit H7BaseBuff]
mName=""
mTooltip=""

[A_ArcaneAmplification_Buff H7BaseBuff]
mName="奥术增强"
mTooltip="该生物受到 %res.norm 更多魔法伤害。"

[A_ArcaneAttunement_Buff H7BaseBuff]
mName="奥术协调"
mTooltip=""

[A_ArcaneChanneling_Buff_Hero H7BaseBuff]
mName="奥术通引"
mTooltip=""

[A_Metamagic_Skill H7Skill]
mDescriptions[0]="元变魔法在战斗过程中充能，允许英雄施放更强大的法术。"
mDescriptions[1]=""
mDescriptions[2]="英雄在每个战斗回合开始时获得 %stat4 点元变魔法，最多 %stat1.norm 点。\n英雄的魔力随元变魔法提高。一旦元变魔法达到 %stat1.norm，英雄施放所有法术至少达到新手等级。"
mDescriptions[3]="元变魔法最多可提升至 %stat2.norm 点。\n一旦元变魔法达到 %stat2.norm，英雄施放所有法术至少达到专家等级。"
mDescriptions[4]="元变魔法最多可提升至 %stat3.norm 点。\n一旦元变魔法达到 %stat3.norm，英雄施放所有法术达到大师等级。"
mName="元变魔法"
mTooltip="学院族技能。"

[A_AreaSynergy_Ability H7HeroAbility]
mName="区域共鸣"
mTooltip="以区域内生物为目标的法术现在也会在这些生物上引发魔法共鸣。"
[A_Clarity_Ability H7HeroAbility]
mName="心领神会"
mTooltip="对于每个引发的魔法共鸣，英雄有50%的几率在该战斗回合获得第二次行动。"
[A_Clarity_Buff H7BaseBuff]
mName="心领神会"
mTooltip="此战斗回合的额外英雄行动。"
[A_DebilitatingShot_Ability H7HeroAbility]
mName="削弱射击"
mTooltip="被小型方尖碑击中的敌方生物获得 %buff.buff.stat %buff.buff.stat.icon 防御，持续 %buff.buff.durini 回合。"
[A_DebilitatingShot_Buff H7BaseBuff]
mName="削弱射击"
mTooltip="%stat %ICON_DEFENSE 防御。\n持续 %durnow 回合。"
[A_MagicAmplification_Ability H7HeroAbility]
mName="魔法增幅"
mTooltip="每个引发的魔法共鸣提供 %buff.buff.stat %buff.buff.stat.icon 魔力（最多+10 %buff.buff.stat.icon 魔力）。持续到战斗结束。"
[A_MagicAmplification_Buff H7BaseBuff]
mName="魔法增幅"
mTooltip="%e1"
[A_MagicAttunement_Ability H7HeroAbility]
mName="魔力协调"
mTooltip="如果一个法术引发了魔法共鸣，英雄恢复该法术一半的法力消耗。"
[A_MagicExaltation_Ability H7HeroAbility]
mName="魔力提升"
mTooltip="如果一个法术将引发魔法共鸣，则以 %buff1.buff.buff.buff.stat %buff1.buff.buff.buff.stat.icon 魔力施放。"
[A_MagicSynergy_Ability H7HeroAbility]
mName="魔法共鸣"
[A_SoulVanishingStrike_Ability H7HeroAbility]
mName="蚀魂打击"
mTooltip="英雄的攻击额外在 %buff.buff.durini 回合内降低目标生物属性 %buff.buff.stat1.norm。\n这影响伤害、攻击、防御、幸运、士气、主动性、生命值和移动力。"
[A_SoulVanishingStrike_Buff H7BaseBuff]
mName="蚀魂打击"
mTooltip="%stat4 %stat4.icon 伤害，%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御，%stat6 %ICON_LUCK 幸运\n%stat7 %ICON_MORALE 士气，%stat3 %ICON_INITIATIVE 主动性\n%stat9 生命值，%stat8 %ICON_MAX_MOVEMENT 移动力\n持续 %durnow 回合。"

UCP 1.3

[A_ArcaneEmpowerment_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术激荡"
mTooltip="当一个友方生物第一次被近战击中时，敌方生物根据友方队伍中的单个生物数量受到 %buff1.buff.d1.min %ICON_PRIME 源力伤害。"

v1.37


[A_ArcaneAttunement_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术协调"
mTooltip="友方生物的 %ICON_DEFENSE 防御和 %ICON_ATTACK 攻击随元变魔法提高。"

[A_ArcaneAmplification_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术增强"
mTooltip="对敌方生物造成的魔法伤害按元变魔法值每点增加1个百分点。\n如果英雄拥有14点或更多 %icon_ARCANE_KNOWLEDGE 魔力，其最大元变魔法增加至15点。\n如果英雄拥有18点或更多 %icon_ARCANE_KNOWLEDGE 魔力，其最大元变魔法增加至20点。"